results/Scaleway/C2S/diskbench.log
$ date
Sat Apr 29 18:22:27 UTC 2017

$ fio "/root/serverbench/scripts/ssd.fio"
seq-read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
rand-read: (g=1): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
seq-write: (g=2): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
rand-write: (g=3): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
fio-2.2.10
Starting 4 processes
seq-read: Laying out IO file(s) (1 file(s) / 1024MB)

seq-read: (groupid=0, jobs=1): err= 0: pid=18988: Sat Apr 29 18:24:53 2017
  read : io=1024.0MB, bw=33325KB/s, iops=8331, runt= 31465msec
    slat (usec): min=9, max=111, avg=20.79, stdev= 4.14
    clat (usec): min=149, max=3433, avg=455.29, stdev=100.11
     lat (usec): min=173, max=3450, avg=476.82, stdev=99.16
    clat percentiles (usec):
     |  1.00th=[  225],  5.00th=[  249], 10.00th=[  278], 20.00th=[  430],
     | 30.00th=[  442], 40.00th=[  454], 50.00th=[  462], 60.00th=[  470],
     | 70.00th=[  478], 80.00th=[  490], 90.00th=[  524], 95.00th=[  668],
     | 99.00th=[  708], 99.50th=[  724], 99.90th=[  748], 99.95th=[  764],
     | 99.99th=[  948]
    bw (KB  /s): min=30952, max=37776, per=100.00%, avg=33367.35, stdev=2174.91
    lat (usec) : 250=5.19%, 500=79.74%, 750=14.98%, 1000=0.08%
    lat (msec) : 2=0.01%, 4=0.01%
  cpu          : usr=3.69%, sys=11.98%, ctx=391021, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read: (groupid=1, jobs=1): err= 0: pid=18989: Sat Apr 29 18:24:53 2017
  read : io=1024.0MB, bw=33104KB/s, iops=8276, runt= 31675msec
    slat (usec): min=15, max=117, avg=21.20, stdev= 4.58
    clat (usec): min=141, max=1046, avg=457.46, stdev=103.39
     lat (usec): min=167, max=1064, avg=479.40, stdev=102.12
    clat percentiles (usec):
     |  1.00th=[  219],  5.00th=[  245], 10.00th=[  274], 20.00th=[  426],
     | 30.00th=[  446], 40.00th=[  454], 50.00th=[  458], 60.00th=[  470],
     | 70.00th=[  478], 80.00th=[  498], 90.00th=[  540], 95.00th=[  684],
     | 99.00th=[  716], 99.50th=[  724], 99.90th=[  748], 99.95th=[  756],
     | 99.99th=[  780]
    bw (KB  /s): min=30904, max=38944, per=100.00%, avg=33113.02, stdev=2460.16
    lat (usec) : 250=6.43%, 500=74.88%, 750=18.61%, 1000=0.07%
    lat (msec) : 2=0.01%
  cpu          : usr=4.39%, sys=11.87%, ctx=391725, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
seq-write: (groupid=2, jobs=1): err= 0: pid=18990: Sat Apr 29 18:24:53 2017
  write: io=1024.0MB, bw=27987KB/s, iops=6996, runt= 37466msec
    slat (usec): min=9, max=120, avg=27.61, stdev= 4.67
    clat (usec): min=218, max=1166.6K, avg=539.73, stdev=4431.60
     lat (usec): min=243, max=1166.6K, avg=568.11, stdev=4431.59
    clat percentiles (usec):
     |  1.00th=[  386],  5.00th=[  414], 10.00th=[  426], 20.00th=[  442],
     | 30.00th=[  454], 40.00th=[  466], 50.00th=[  478], 60.00th=[  490],
     | 70.00th=[  510], 80.00th=[  660], 90.00th=[  708], 95.00th=[  732],
     | 99.00th=[  908], 99.50th=[  924], 99.90th=[  964], 99.95th=[  972],
     | 99.99th=[ 1224]
    bw (KB  /s): min= 1319, max=32072, per=100.00%, avg=28539.93, stdev=3606.70
    lat (usec) : 250=0.01%, 500=65.54%, 750=31.06%, 1000=3.37%
    lat (msec) : 2=0.02%, 4=0.01%, 10=0.01%, 50=0.01%, 250=0.01%
    lat (msec) : 2000=0.01%
  cpu          : usr=3.74%, sys=11.13%, ctx=399702, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write: (groupid=3, jobs=1): err= 0: pid=18993: Sat Apr 29 18:24:53 2017
  write: io=1024.0MB, bw=29416KB/s, iops=7353, runt= 35647msec
    slat (usec): min=13, max=128, avg=27.75, stdev= 4.67
    clat (usec): min=217, max=42267, avg=511.12, stdev=177.19
     lat (usec): min=249, max=42296, avg=539.63, stdev=176.57
    clat percentiles (usec):
     |  1.00th=[  386],  5.00th=[  410], 10.00th=[  422], 20.00th=[  438],
     | 30.00th=[  450], 40.00th=[  462], 50.00th=[  474], 60.00th=[  486],
     | 70.00th=[  502], 80.00th=[  604], 90.00th=[  692], 95.00th=[  724],
     | 99.00th=[  884], 99.50th=[  916], 99.90th=[  956], 99.95th=[  972],
     | 99.99th=[ 1112]
    bw (KB  /s): min=23152, max=31688, per=100.00%, avg=29466.25, stdev=1629.76
    lat (usec) : 250=0.01%, 500=69.18%, 750=28.23%, 1000=2.56%
    lat (msec) : 2=0.02%, 10=0.01%, 50=0.01%
  cpu          : usr=4.38%, sys=11.81%, ctx=398763, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: io=1024.0MB, aggrb=33325KB/s, minb=33325KB/s, maxb=33325KB/s, mint=31465msec, maxt=31465msec

Run status group 1 (all jobs):
   READ: io=1024.0MB, aggrb=33104KB/s, minb=33104KB/s, maxb=33104KB/s, mint=31675msec, maxt=31675msec

Run status group 2 (all jobs):
  WRITE: io=1024.0MB, aggrb=27987KB/s, minb=27987KB/s, maxb=27987KB/s, mint=37466msec, maxt=37466msec

Run status group 3 (all jobs):
  WRITE: io=1024.0MB, aggrb=29415KB/s, minb=29415KB/s, maxb=29415KB/s, mint=35647msec, maxt=35647msec

Disk stats (read/write):
  nbd0: ios=524288/523882, merge=0/26, ticks=237130/272180, in_queue=509010, util=99.19%

$ sysbench --test=fileio --file-total-size=6G prepare
sysbench 0.4.12:  multi-threaded system evaluation benchmark

128 files, 49152Kb each, 6144Mb total
Creating files for the test...

$ sysbench --test=fileio --file-total-size=6G --file-test-mode=rndrw  --max-time=300 --max-requests=0 --file-extra-flags=direct run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1

Extra file open flags: 16384
128 files, 48Mb each
6Gb total file size
Block size 16Kb
Number of random requests for random IO: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Threads started!
Time limit exceeded, exiting...
Done.

Operations performed:  409282 Read, 272855 Write, 873088 Other = 1555225 Total
Read 6.2451Gb  Written 4.1634Gb  Total transferred 10.409Gb  (35.528Mb/sec)
 2273.79 Requests/sec executed

Test execution summary:
    total time:                          300.0004s
    total number of events:              682137
    total time taken by event execution: 290.9639
    per-request statistics:
         min:                                  0.18ms
         avg:                                  0.43ms
         max:                                847.40ms
         approx.  95 percentile:               0.55ms

Threads fairness:
    events (avg/stddev):           682137.0000/0.00
    execution time (avg/stddev):   290.9639/0.00


$ sysbench --test=fileio --file-total-size=6G --file-test-mode=rndrw --max-time=300 --file-fsync-all --max-requests=0 --num-threads=8 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8

Extra file open flags: 0
128 files, 48Mb each
6Gb total file size
Block size 16Kb
Number of random requests for random IO: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Threads started!
Time limit exceeded, exiting...
(last message repeated 7 times)
Done.

Operations performed:  64451 Read, 42972 Write, 42972 Other = 150395 Total
Read 1007Mb  Written 671.44Mb  Total transferred 1.6391Gb  (5.5946Mb/sec)
  358.05 Requests/sec executed

Test execution summary:
    total time:                          300.0208s
    total number of events:              107423
    total time taken by event execution: 2400.0380
    per-request statistics:
         min:                                  0.00ms
         avg:                                 22.34ms
         max:                                218.56ms
         approx.  95 percentile:              98.96ms

Threads fairness:
    events (avg/stddev):           13427.8750/138.22
    execution time (avg/stddev):   300.0048/0.00


$ sysbench --test=fileio --file-total-size=6G --file-test-mode=rndrw --max-time=300 --file-fsync-all --max-requests=0 --num-threads=64 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64

Extra file open flags: 0
128 files, 48Mb each
6Gb total file size
Block size 16Kb
Number of random requests for random IO: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Threads started!
Time limit exceeded, exiting...
(last message repeated 63 times)
Done.

Operations performed:  378597 Read, 252442 Write, 252442 Other = 883481 Total
Read 5.7769Gb  Written 3.852Gb  Total transferred 9.6289Gb  (32.863Mb/sec)
 2103.21 Requests/sec executed

Test execution summary:
    total time:                          300.0355s
    total number of events:              631039
    total time taken by event execution: 19200.8107
    per-request statistics:
         min:                                  0.00ms
         avg:                                 30.43ms
         max:                                720.82ms
         approx.  95 percentile:             107.55ms

Threads fairness:
    events (avg/stddev):           9859.9844/165.99
    execution time (avg/stddev):   300.0127/0.00


$ sysbench --test=fileio --file-total-size=6G cleanup
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Removing test files...