results/Scaleway/C2S/mysqlbench.log
$ date
Sat Apr 29 18:41:46 UTC 2017

$ mysql -V
mysql  Ver 15.1 Distrib 10.0.29-MariaDB, for debian-linux-gnu (x86_64) using readline 5.2

$ mysql -u root -p -e "create database benchmark;"

$ sysbench --test=oltp --oltp-table-size=1000000 --mysql-db=benchmark --mysql-user=root --mysql-password=123456 prepare
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Creating table 'sbtest'...
Creating 1000000 records in table 'sbtest'...

$ sysbench --test=oltp --oltp-table-size=1000000 --mysql-db=benchmark --mysql-user=root --mysql-password=123456 --max-time=60 --oltp-read-only=on --max-requests=0 --num-threads=8 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 8

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 7 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            431130
        write:                           0
        other:                           61590
        total:                           492720
    transactions:                        30795  (513.14 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 431130 (7183.91 per sec.)
    other operations:                    61590  (1026.27 per sec.)

Test execution summary:
    total time:                          60.0133s
    total number of events:              30795
    total time taken by event execution: 479.7354
    per-request statistics:
         min:                                  3.78ms
         avg:                                 15.58ms
         max:                                 83.35ms
         approx.  95 percentile:              19.96ms

Threads fairness:
    events (avg/stddev):           3849.3750/31.34
    execution time (avg/stddev):   59.9669/0.00


$ sysbench --test=oltp --oltp-table-size=10000000 --mysql-db=benchmark --mysql-user=root --mysql-password=123456 --max-time=60 --max-requests=0 --num-threads=16 --oltp-reconnect-mode=random run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            149842
        write:                           53515
        other:                           83774
        total:                           287131
    transactions:                        10700  (177.78 per sec.)
    deadlocks:                           3      (0.05 per sec.)
    read/write requests:                 203357 (3378.81 per sec.)
    other operations:                    83774  (1391.92 per sec.)

Test execution summary:
    total time:                          60.1860s
    total number of events:              10700
    total time taken by event execution: 961.2220
    per-request statistics:
         min:                                  3.42ms
         avg:                                 89.83ms
         max:                                677.22ms
         approx.  95 percentile:             261.49ms

Threads fairness:
    events (avg/stddev):           668.7500/28.19
    execution time (avg/stddev):   60.0764/0.07


$ sysbench --test=oltp --mysql-db=benchmark --mysql-user=root --mysql-password=123456 cleanup
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Dropping table 'sbtest'...
Done.

$ mysql -u root -p -e "drop database benchmark;"